# Space_AddRoomID

## Description
Add a new RoomID to the space object.

```pascal
PROCEDURE Space_AddRoomID(
				space  : HANDLE;
				roomID : STRING);
```

```python

def vs.Space_AddRoomID(space, roomID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|space|HANDLE||
|roomID|STRING||

## Version
Availability: from Vectorworks 2014
## Category
* SpaceObjectCoreTools